Thanks for reporting @Veetaha . We have recently pushed a couple of changes for the KMS API - can you please pull the `latest` Docker image and give it another try? Seems like your sample deploys properly with the latest LocalStack version:

```
$ tf --version
Terraform v1.1.7
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v4.6.0
$ tf apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.example will be created
  + resource "aws_kms_key" "example" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "RSA_2048"
      + description                        = "Some description"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_kms_key.example: Creating...
aws_kms_key.example: Creation complete after 0s [id=c8fa37ae-cee4-4883-913b-0b19dc74dfd7]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Hope that helps - please let us know if the problem persists.. Thanks!